{"keras_version": "2.1.1", "backend": "tensorflow", "config": {"input_layers": [["input_7", 0, 0]], "output_layers": [["dense_18", 0, 0]], "name": "model_6", "layers": [{"name": "input_7", "config": {"batch_input_shape": [null, 61, 73, 1], "sparse": false, "name": "input_7", "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_9", "config": {"name": "conv2d_9", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_10", "config": {"name": "conv2d_10", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_5", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_19", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_19", "trainable": true, "seed": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_11", "config": {"name": "conv2d_11", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_12", "config": {"name": "conv2d_12", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_6", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_20", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_20", "trainable": true, "seed": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_3", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_17", "config": {"name": "dense_17", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_21", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_21", "trainable": true, "seed": null}, "inbound_nodes": [[["dense_17", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_18", "config": {"name": "dense_18", "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model"}